app/controllers/tasks_controller.rb

SELECT * FROM `tasks`
SELECT * FROM `users`
---
def index
  @u_id=session[:user_id]
  if (params[:status]=="1")
    @tasks=Task.paginate(:page=>params[:page],:per_page=>5,:select=>"tasks.*,tags.task_order",:joins=>:tags,:conditions=>["tags.user_id=? and status=1",@u_id],:order=>"tags.task_order DESC")

SELECT * FROM `tasks`
---
def update
  @u_id=session[:user_id]
  t=Task.find(params[:id])
  if t.user_id==@u_id
      if t.status==0
         Task.find(params[:id]).update_attributes(:status=>1)
         @tasks=Task.paginate(:page=>params[:page],:per_page=>5,:select=>"tasks.*,tags.task_order",:joins=>:tags,:conditions=>["tags.user_id=? and status=0",@u_id],:order=>"tags.task_order DESC")