app/controllers/tasks_controller.rb

def create
@tasks=Task.all
@task = Task.new(params[:task])
@task[:task_order]=@tasks.size
@task[:status]=0;
@task[:users_id]=session[:user_id]

puts @task[:id]

  if @task.save
---
SELECT * FROM `tasks` WHERE (users_id=3) ORDER BY task_order DESC
INSERT INTO `tasks` (`user_id`, `task`, `order`, `status`, `created_at`, `updated_at`) VALUES(NULL, 'hlooooo', NULL, NULL, '2014-11-12 11:03:35', '2014-11-12 11:03:35')

  def index
    @u_id=session[:user_id]

    @tasks=Task.find(:all,:conditions => "users_id=#{@u_id}",:order=>"task_order DESC")
---
SELECT * FROM `tasks` WHERE (users_id=@u_id) ORDER BY task_order DESC

  def destroy
    @u_id=session[:user_id]
    @d_id=params[:id]
    Task.destroy(@d_id)
    @tasks=Task.all
    @tasks=Task.find(:all,:conditions => "users_id=#{@u_id}",:order=>"task_order DESC")
---
DELETE FROM `tasks` WHERE `id` = 10
SELECT * FROM `tasks` WHERE (users_id=1) ORDER BY task_order DESC
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 10)

  def new
    @user=User.first
---
SELECT * FROM `users` LIMIT 1

def changeorder_down
    @u_id=session[:user_id]
    task_id=params[:task][:task_id].to_i
    task_id_up=task_id+1
    order_id=params[:order_id].to_i
    order_up_id=order_id-1;
    puts "*********************yes its***********************"
    puts task_id
    puts order_up_id
    Task.find(task_id).update_attributes(:task_order=>order_up_id)
---
SELECT * FROM `tasks` WHERE (users_id=1) ORDER BY task_order DESC
UPDATE `tasks` SET `updated_at` = '2014-11-18 06:16:54', `task_order` = -1 WHERE `id` = 405

def changeorder_up
  @u_id=session[:user_id]
  task_id=params[:task][:task_id].to_i
  task_id_up=task_id-1
  order_id=params[:order_id].to_i
  order_up_id=order_id+1;
  puts task_id
  puts order_up_id

  Task.find(task_id).update_attributes(:task_order=>order_up_id)
---
SELECT * FROM `tasks` WHERE (users_id=1) ORDER BY task_order DESC
UPDATE `tasks` SET `updated_at` = '2014-11-18 05:53:23', `task_order` = 384 WHERE `id` = 384

  def update
        @u_id=session[:user_id]
        Task.find(params[:id]).update_attributes(:status=>1)
---
SELECT * FROM `tasks` WHERE (users_id=1) ORDER BY task_order DESC
UPDATE `tasks` SET `status` = 1, `updated_at` = '2014-11-17 13:48:25' WHERE `id` = 365