app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'sobin@gmail.com') LIMIT 1
---
  def login
    @user=User.new
    if request.post?
      uname=params["user"]["email"]
      paswd=params["user"]["password"]
      @u=User.find_by_email(uname)

INSERT INTO `users` (`password`, `check`, `created_at`, `name`, `email`, `updated_at`) VALUES('$2a$10$bzig1yMeo1CbuotoOSCJF.d0GLuR8gavq20WvpIf4lLuGYyd/AFZW', NULL, '2014-11-13 08:46:30', 'ss', 'sobi@gmail.com', '2014-11-13 08:46:30')
---
  def create
    @user=User.new(params[:user])
    @user[:check]=(1900 + rand(81)).to_s
    paswd=params["user"]["password"]
    if @user.save